#include <stdio.h>

int main()
{
    int x,y,z,f,o;
    scanf("%d",&x);
    o=x;
    y=x/10000;
    z=x%10000;
    x=y*y;
    y=2*y*z;   // 可能產生九位數字
    z=z*z;
    f=x/10000+(y/100000000);
    x=x%10000+(y/10000%10000);
    y=y%10000+(z/10000);
    z=z%10000;
    if(o<31622776)
    {
        printf(" %d%04d%04d%04d",f+(x/10000),x%10000+(y/10000),y%10000+(z/10000),z%10000);
    }
    else
    {
        printf("%d%04d%04d%04d",f+(x/10000),x%10000+(y/10000),y%10000+(z/10000),z%10000);
    }
    return 0;
}